
[StaffRoll]
Staff6L=GUILTY GEAR Xrd REV 2
Staff7L=STAFF CREDITS
Staff19L=Original Works
Staff21L=石渡 太輔／アークシステムワークス
Staff21_subL=Daisuke Ishiwatari / ARC SYSTEM WORKS
Staff30L=CAST
Staff32L=SOL BADGUY
Staff32R=中田 譲治
Staff32_subR=Jouji Nakata
Staff33L=KY KISKE
Staff33R=草尾 毅
Staff33_subR=Takeshi Kusao
Staff34L=MAY
Staff34R=こおろぎさとみ
Staff34_subR=Satomi Koorogi
Staff35L=MILLIA RAGE
Staff35R=住友 優子
Staff35_subR=Yuuko Sumitomo
Staff36L=CHIPP ZANUFF
Staff36R=川原 慶久
Staff36_subR=Yoshihisa Kawahara
Staff37L=VENOM
Staff37R=諏訪部 順一
Staff37_subR=Junichi Suwabe
Staff38L=POTEMKIN
Staff38R=近藤 隆
Staff38_subR=Takashi Kondou
Staff39L=AXL LOW
Staff39R=難波 圭一
Staff39_subR=Keiichi Nanba
Staff40L=I-NO
Staff40R=井上 喜久子
Staff40_subR=Kikuko Inoue
Staff41L=FAUST
Staff41R=近藤 隆
Staff41_subR=Takashi Kondou
Staff42L=SLAYER
Staff42R=土師 孝也
Staff42_subR=Takaya Hashi
Staff43L=ZATO=1 / EDDIE
Staff43R=子安 武人
Staff43_subR=Takehito Koyasu
Staff44L=BEDMAN
Staff44R=緑川 光
Staff44_subR=Hikaru Midorikawa
Staff45L=RAMLETHAL VALENTINE
Staff45R=潘 めぐみ
Staff45_subR=Megumi Han
Staff46L=SIN KISKE
Staff46R=宮崎 一成
Staff46_subR=Issei Miyazaki
Staff47L=ELPHELT VALENTINE
Staff47R=洲崎 綾
Staff47_subR=Aya Suzaki
Staff48L=LEO WHITEFANG
Staff48R=稲田 徹
Staff48_subR=Tetsu Inada
Staff49L=JOHNNY
Staff49R=若本 規夫
Staff49_subR=Norio Wakamoto
Staff50L=JACK-O' VALENTINE
Staff50R=五十嵐 裕美
Staff50_subR=Hiromi Igarashi
Staff51L=JAM KURADOBERI
Staff51R=松嵜 麗
Staff51_subR=Rei Matsuzaki
Staff52L=KUM HAEHYUN
Staff52R=手塚 秀彰
Staff52_subR=Hideaki Tezuka
Staff53L=RAVEN
Staff53R=安元 洋貴
Staff53_subR=Hiroki Yasumoto
Staff54L=DIZZY
Staff54R=藤田 佳寿恵
Staff54_subR=Kazue Fujita
Staff55L=BAIKEN
Staff55R=浅野 まゆみ
Staff55_subR=Mayumi Asano
Staff56L=ANSWER
Staff56R=関 智一
Staff56_subR=Tomokazu Seki
Staff59L=THAT MAN
Staff59R=杉田 智和
Staff59_subR=Tomokazu Sugita
Staff60L=GABRIEL
Staff60R=菅生 隆之
Staff60_subR=Takayuki Sugou
Staff61L=VERNON
Staff61R=梁田 清之
Staff61_subR=Kiyoyuki Yanada
Staff62L=CHRONUS
Staff62R=坪井 智徳
Staff62_subR=Tomonori Tsuboi
Staff63L=ARIELS
Staff63R=皆川 純子
Staff63_subR=Junko Minagawa
Staff65L=NARRATION
Staff65R=菅生 隆之
Staff65_subR=Takayuki Sugou
Staff67L=SYSTEM VOICE
Staff67R=Dan Rubida
Staff67_subR=Dan Rubida
Staff68L=APRIL & LEAP
Staff68R=磯村 知美
Staff68_subR=Tomomi Isomura
Staff69L=AUGUS
Staff69R=住友 優子
Staff69_subR=Yuuko Sumitomo
Staff70L=JUNE
Staff70R=潘 めぐみ
Staff70_subR=Megumi Han
Staff71L=SEPHY / MARCH
Staff71R=藤川 茜
Staff71_subR=Akane Fujikawa
Staff72L=FEBBY / NOVEL  / OCTY  / JANIS
Staff72R=松本 夕紀
Staff72_subR=Yuuki Matsumoto
Staff74L=GAUNTLET BODY
Staff74R=杉田 智和
Staff74_subR=Tomokazu Sugita
Staff75R=坪井 智徳
Staff75_subR=Tomonori Tsuboi
Staff76R=梁田 清之
Staff76_subR=Kiyoyuki Yanada
Staff77L=CONVICT HUMMER
Staff77R=梁田 清之
Staff77_subR=Kiyoyuki Yanada
Staff78L=JACK-O's Servant
Staff78R=有馬 七助
Staff78_subR=Nanasuke Arima
Staff80L=HYORI
Staff80R=岩澤 俊樹
Staff80_subR=Toshiki Iwasawa
Staff81L=TELEPHONE OPERATOR
Staff81R=高橋 信
Staff81_subR=Makoto Takahashi
Staff82L=MAN ON THE PHONE
Staff82R=五十嵐 亨
Staff82_subR=Toru Igarashi
Staff83L=PATIENT
Staff83R=五十嵐 裕美
Staff83_subR=Hiromi Igarashi
Staff84L=TOWN
Staff84R=藤川 茜
Staff84_subR=Akane Fujikawa
Staff86L=EXTRA
Staff86R=石渡 太輔
Staff86_subR=Daisuke Ishiwatari
Staff87R=坂村 英彦
Staff87_subR=Hidehiko Sakamura
Staff88R=片野 旭
Staff88_subR=Akira Katano
Staff89R=山中 丈嗣
Staff89_subR=Takeshi Yamanaka
Staff90R=関根 一利
Staff90_subR=Kazuto Sekine
Staff91R=本村 C. 純也
Staff91_subR=Junya C. Motomura
Staff92R=澤田 秀明
Staff92_subR=Hideaki Sawada
Staff93R=浅野 健太
Staff93_subR=Kenta Asano
Staff94R=松田 芳明
Staff94_subR=Yoshiake Matsuda
Staff98L=DEVELOPMENT STAFF
Staff100L=logo_RED
Staff104L=Game & Character Design
Staff104R=石渡 太輔
Staff104_subR=Daisuke Ishiwatari
Staff106L=Products Planning
Staff106R=石渡 太輔
Staff106_subR=Daisuke Ishiwatari
Staff107R=山中 丈嗣
Staff107_subR=Takeshi Yamanaka
Staff109L=Director
Staff109R=片野 旭
Staff109_subR=Akira Katano
Staff111L=Art Director
Staff111R=坂村 英彦
Staff111_subR=Hidehiko Sakamura
Staff112L=Lead Programmer
Staff112R=野沢 武史
Staff112_subR=Takeshi Nozawa
Staff113L=Lead Planner
Staff113R=関根 一利
Staff113_subR=Kazuto Sekine
Staff114L=Lead Environment Artist
Staff114R=儘田 元気
Staff114_subR=Genki Mamada
Staff115L=Lead Effect Artist
Staff115R=小川 和哉
Staff115_subR=Kazuya Ogawa
Staff116L=Lead HUD Artist
Staff116R=小山 健太郎
Staff116_subR=Kentaro Koyama
Staff118L=Project Manager
Staff118R=山中 丈嗣
Staff118_subR=Takeshi Yamanaka
Staff121L=Lead Battle Planner
Staff121R=関根 一利
Staff121_subR=Kazuto Sekine
Staff122L=Planners
Staff122R=片野 旭
Staff122_subR=Akira Katano
Staff123R=松田 芳明
Staff123_subR=Yoshiake Matsuda
Staff124R=佐藤 題
Staff124_subR=Shirushi Sato
Staff125R=中野 雅広
Staff125_subR=Masahiro Nakano
Staff128L=Lead Programmer
Staff128R=野沢 武史
Staff128_subR=Takeshi Nozawa
Staff129L=Programmers
Staff129R=廣田 淳司
Staff129_subR=Atsushi Hirota
Staff130R=米須 勇介
Staff130_subR=Yusuke Komesu
Staff131R=大里 亮太
Staff131_subR=Ryouta Oosato
Staff132R=福島 有貴
Staff132_subR=Yuki Fukushima
Staff134L=Engine Customization
Staff134R=家弓 拓郎
Staff134_subR=Takuro Kayumi
Staff137L=Lead 2D Artist
Staff137R=郷間 幸範
Staff137_subR=Yukinori Gouma
Staff138L=2D Artists
Staff138R=澤田 秀明
Staff138_subR=Hideaki Sawada
Staff139R=浅野 健太
Staff139_subR=Kenta Asano
Staff140R=加藤 英典
Staff140_subR=Eisuke Kato
Staff142L=Action Choreography
Staff142R=坂村 英彦
Staff142_subR=Hidehiko Sakamura
Staff143R=澤田 秀明
Staff143_subR=Hideaki Sawada
Staff144R=坪井 利浩
Staff144_subR=Toshihiro Tsuboi
Staff145R=郷間 幸範
Staff145_subR=Yukinori Gouma
Staff147L=Lead HUD Artist
Staff147R=小山 健太郎
Staff147_subR=Kentaro Koyama
Staff148L=HUD Artist
Staff148R=田中 友佑
Staff148_subR=Yusuke Tanaka
Staff150L=LOGO Design
Staff150R=清水 幸一
Staff150_subR=Kouichi Shimizu
Staff151R=小山 健太郎
Staff151_subR=Kentaro Koyama
Staff153L=Lead Character Modeler
Staff153R=川崎 壮一
Staff153_subR=Souichi Kawasaki
Staff154L=Character Modelers
Staff154R=尾崎 裕子
Staff154_subR=Yuko Ozaki
Staff156L=Animation Workflow Manager
Staff156R=坂村 英彦
Staff156_subR=Hidehiko Sakamura
Staff158L=Lead Animator
Staff158R=坂村 英彦
Staff158_subR=Hidehiko Sakamura
Staff159L=Animators
Staff159R=坪井 利浩
Staff159_subR=Toshihiro Tsuboi
Staff160R=権坐 英明
Staff160_subR=Hideaki Gonza
Staff162L=Lead Effects Artist
Staff162R=小川 和哉
Staff162_subR=Kazuya Ogawa
Staff163L=2D Effect Artists
Staff163R=郷間 幸範
Staff163_subR=Yukinori Gouma
Staff165L=Lead Environment Artist
Staff165R=儘田 元気
Staff165_subR=Genki Mamada
Staff166L=Environment Artists
Staff166R=五十嵐 和也
Staff166_subR=Kazuya Igarashi
Staff167R=齋藤 豊
Staff167_subR=Yutaka Saito
Staff168R=村松 桂
Staff168_subR=Katsura Muramatsu
Staff170L=Environment Image board 
Staff170R=儘田 元気
Staff170_subR=Genki Mamada
Staff173L=Draft Scenario
Staff173R=石渡 太輔
Staff173_subR=Daisuke Ishiwatari
Staff175L=Scenario
Staff175R=石渡 太輔
Staff175_subR=Daisuke Ishiwatari
Staff176R=山中 丈嗣
Staff176_subR=Takeshi Yamanaka
Staff178L=Storyboard
Staff178R=石渡 太輔
Staff178_subR=Daisuke Ishiwatari
Staff179R=坂村 英彦
Staff179_subR=Hidehiko Sakamura
Staff180R=儘田 元気
Staff180_subR=Genki Mamada
Staff182L=Story Scripter
Staff182R=石渡 太輔
Staff182_subR=Daisuke Ishiwatari
Staff183R=坂村 英彦
Staff183_subR=Hidehiko Sakamura
Staff184R=澤田 秀明
Staff184_subR=Hideaki Sawada
Staff185R=松田 芳明
Staff185_subR=Yoshiake Matsuda
Staff189L=PUBLISHING STAFF
Staff191L=PR
Staff191R=鈴木 美香
Staff191_subR=Mika Suzuki
Staff192R=須藤 夏葉
Staff192_subR=Natsuha Sudo
Staff193R=桑原 卓也
Staff193_subR=Takuya Kuwabara
Staff194R=佐藤 朱菜
Staff194_subR=Ayana Sato
Staff196L=PR Assistant
Staff196R=清水 幸一
Staff196_subR=Kouichi Shimizu
Staff197R=幸村 葉子
Staff197_subR=Youko Koumura
Staff199L=User Support
Staff199R=水野 美穂
Staff199_subR=Miho Mizuno
Staff201L=Sales
Staff201R=齋藤 聡
Staff201_subR=Satoshi Saito
Staff202R=浅香 恵美子
Staff202_subR=Emiko Asaka
Staff204L=Marketing Director
Staff204R=福島 伸明
Staff204_subR=Nobuaki Fukushima
Staff210L=SOUNDWORKS
Staff212L=Composers
Staff212R=石渡 太輔
Staff212_subR=Daisuke Ishiwatari
Staff213R=佐藤 ノリチカ
Staff213_subR=Norichika Sato
Staff214R=滝澤 俊輔 (Try Tone Lobo)
Staff214_subR=Syunsuke Takizawa
Staff216L=Arrangement
Staff216R=佐藤 ノリチカ
Staff216_subR=Norichika Sato
Staff218L=Vocal
Staff218R=橋本 直樹
Staff218_subR=NAOKI HASHIMOTO
Staff219L=Guitar
Staff219R=梶原 稔広
Staff219_subR=Toshihiro Kajihara
Staff220L=Bass
Staff220R=長谷川 淳
Staff220_subR=Atsushi Hasegawa
Staff221L=Sax
Staff221R=徳広 裕
Staff221_subR=Yutaka Tokuhiro
Staff222L=Piano
Staff222R=滝澤 俊輔
Staff222_subR=Syunsuke Takizawa
Staff224L=Recording＆Mix Engineer
Staff224R=macoteau
Staff224_subR=macoteau
Staff228L=Voice Recording Engineer
Staff228R=前田 大介
Staff228_subR=Daisuke Maeda
Staff229R=尹 知彗
Staff229_subR=Yun Chie
Staff231L=Voice Recording Director
Staff231R=大沼 隆一
Staff231_subR=Ryuichi Onuma
Staff233L=MIKI Production Inc.
Staff233R=三木 幸生
Staff233_subR=Yukio Miki
Staff235L=Voice Recording Studio
Staff235R=キャビネットスタジオ
Staff235_subR=Studio Cabinet
Staff237L=Voice Recording Director
Staff237R=石渡 太輔
Staff237_subR=Daisuke Ishiwatari
Staff238R=山中 丈嗣
Staff238_subR=Takeshi Yamanaka
Staff239R=松田 芳明
Staff239_subR=Yoshiake Matsuda
Staff241L=Voice Recording & Edit Engineer
Staff241R=渡辺 大志
Staff241_subR=Taishi Watanabe
Staff244L=Studio mech
Staff246L=Studio StarJamRoom
Staff247L=Manager
Staff247R=小泉 寿子
Staff247_subR=Yoshiko Koizumi
Staff250L=Sound Effects
Staff250R=渡辺 大志
Staff250_subR=Taishi Watanabe
Staff251R=佐藤 ノリチカ
Staff251_subR=Norichika Sato
Staff252R=山中 丈嗣
Staff252_subR=Takeshi Yamanaka
Staff253R=松田 芳明
Staff253_subR=Yoshiake Matsuda
Staff255L=Sound Producer
Staff255R=鈴木 高雄 (Starjam Corporation)
Staff255_subR=Takao Suzuki
Staff259L=SONGS
Staff261L=""Break a Spell""
Staff261R=""N.S.F.W.""
Staff262L=Composer  石渡 太輔
Staff262_subL=Composer  Daisuke Ishiwatari
Staff262R=Composer  石渡 太輔
Staff262_subR=Composer  Daisuke Ishiwatari
Staff263L=Arrangement  佐藤 ノリチカ
Staff263_subL=Arrangement  Norichika Sato
Staff263R=Arrangement  佐藤 ノリチカ
Staff263_subR=Arrangement  Norichika Sato
Staff264L=Lyrics 石渡 太輔 & マイキー マクナマラ
Staff264_subL=Lyrics Daisuke Ishiwatari & Mikey McNamara
Staff264R=Lyrics 石渡 太輔 & マイキー マクナマラ
Staff264_subR=Lyrics Daisuke Ishiwatari & Mikey McNamara
Staff265L=Vocal  橋本 直樹
Staff265_subL=Vocal  NAOKI HASHIMOTO
Staff265R=Vocal  橋本 直樹
Staff265_subR=Vocal  NAOKI HASHIMOTO
Staff266L=Guitar  梶原 稔広 
Staff266_subL=Guitar  Toshihiro Kajihara
Staff266R=Guitar  梶原 稔広 
Staff266_subR=Guitar  Toshihiro Kajihara
Staff267L=Bass  長谷川 淳
Staff267_subL=Bass  Atsushi Hasegawa
Staff267R=Bass  長谷川 淳
Staff267_subR=Bass  Atsushi Hasegawa
Staff275L=Development Partners
Staff278L=logo_newronage
Staff281L=NEURON AGE Co., Ltd.
Staff282L=Senior Designer
Staff282R=長澤 一
Staff282_subR=Hajime Nagasawa
Staff283L=Designer
Staff283R=山領 忠幸
Staff283_subR=Tadayuki Yamaryou
Staff284R=石本 未織
Staff284_subR=Miori Ishimoto
Staff285R=山領 忠幸
Staff285_subR=Tadayuki Yamaryo
Staff286L=Business Manager
Staff286R=冨士末 登喜夫
Staff286_subR=Tokio Fujisue
Staff287L=Executive General Manager
Staff287R=二階 学
Staff287_subR=Nikai Manabu
Staff289L=Bean Pod Corp.
Staff290L=CG Director
Staff290R=大野 雅子
Staff290_subR=Masako Oono
Staff291L=CG Animator
Staff291R=磯谷 涼汰
Staff291_subR=Ryouta Isogai
Staff292R=伊藤 奈々美
Staff292_subR=Nanami Itou
Staff294L=SUCCESS Corporation
Staff295L=Designer
Staff295R=木村 孝史
Staff295_subR=Takashi Kimura
Staff296R=小松原 勇一
Staff296_subR=Yuuichi Komatsubara
Staff297R=石島 凌汰
Staff297_subR=Ryota Ishijima
Staff298R=野明 春香
Staff298_subR=Haruka Noake
Staff301L=Starjam Corporation, ltd
Staff302L=Sound Producer
Staff302R=鈴木 高雄
Staff302_subR=Takao Suzuki
Staff303L=Assistant Director
Staff303R=栗山 健太
Staff303_subR=Kenta Kuriyama
Staff308L=Opening Movie Products
Staff310L=Iris Motion Graphics
Staff313L=Freelance
Staff315L=Background Artists
Staff315R=朝見 知弥
Staff315_subR=Tomoya Asami
Staff317L=Action Choreography
Staff317R=井上 巧
Staff317_subR=Takumi Inoue
Staff318R=寺田 完
Staff318_subR=Yutaka Terada
Staff320L=Animator
Staff320R=永野 覧
Staff320_subR=Ran Nagano
Staff322L=Animation Director
Staff322R=月見里 智弘
Staff322_subR=Tomohiro Tsukimisato
Staff324L=Battle Balance Advisors
Staff324R=神園 雄太
Staff324_subR=Yuta Kamizono
Staff327L=Debugging Staff
Staff329L=DREAMS CORPORATION
Staff330L=Testers
Staff330R=髙橋 聖
Staff330_subR=Kiyoshi Takahashi
Staff331R=畑 雄介
Staff331_subR=Yusuke Hata
Staff332R=山林 大祐
Staff332_subR=Daisuke Yamabayashi
Staff335L=Player's Guild Creation
Staff337L=ARC SYSTEM WORKS
Staff338L=Producers
Staff338R=安部 秀之
Staff338_subR=Hideyuki Anbe
Staff339R=藤本 貴文
Staff339_subR=Takafumi Fujimoto
Staff340L=Network Engineer
Staff340R=本間 拓也
Staff340_subR=Takuya Honma
Staff342L=Planning
Staff342R=山中 丈嗣
Staff342_subR=Takeshi Yamanaka
Staff343R=片野 旭
Staff343_subR=Akira Katano
Staff344R=中野 雅広
Staff344_subR=Masahiro Nakano
Staff345L=Programmer
Staff345R=廣田 淳司
Staff345_subR=Atsushi Hirota
Staff346L=Art Works
Staff346R=小山 健太郎
Staff346_subR=Kentaro Koyama
Staff348L=TRIAD Ltd.
Staff349L=Director
Staff349R=澤崎 享介
Staff349_subR=Kyosuke Sawazaki
Staff350L=Programmer
Staff350R=西本 誠
Staff350_subR=Makoto Nishimoto
Staff354L=Publishing Support
Staff356L=Exmind, Inc.
Staff357L=Director
Staff357R=今野 裕介
Staff357_subR=Yusuke Konno
Staff358L=Advertisement Design
Staff358R=松本 正子
Staff358_subR=Masako Matsumoto
Staff361L=Special Thanks
Staff363L=ARC SYSTEM WORKS
Staff363R=川上 裕貴
Staff363_subR=Yuki Kawakami
Staff364R=有馬 七助
Staff364_subR=Nanasuke Arima
Staff365R=伊藤 誠
Staff365_subR=Makoto Ito
Staff366R=小澤 陸
Staff366_subR=Riku Ozawa
Staff370R=ARC SYSTEM WORKS ALL STAFF
Staff374L=logo_sega
Staff377L=SEGA Interactive Co.,Ltd.
Staff377R=宇野 薫
Staff377_subR=Kaoru Uno
Staff378R=大島 正己
Staff378_subR=Masami Oshima
Staff379R=大林 克
Staff379_subR=Masaru Obayashi
Staff380R=川島 卓
Staff380_subR=Suguru Kawashima
Staff381R=中屋 年裕
Staff381_subR=Toshihiro Nakaya
Staff384L=Epic Games Japan
Staff385L=Territory Manager
Staff385R=河崎 高之
Staff385_subR=Taka Kawasaki
Staff386L=Support Manager
Staff386R=下田 純也
Staff386_subR=Junya Shimoda
Staff387L=Support Technical Artist
Staff387R=ロブ グレイ
Staff387_subR=Rob Gray
Staff388L=Support Engineer
Staff388R=ジョー コンリー
Staff388_subR=Joe Conley
Staff391L=Strangely Compelling
Staff392L=Localize Supervisor
Staff392R=マイキー マクナマラ
Staff392_subR=Mikey McNamara
Staff406L=logo_UE3
Staff417L=ARC SYSTEM WORKS
Staff418L=Line Producer
Staff418R=森 利道
Staff418_subR=Toshimichi Mori
Staff419R=田口 和憲
Staff419_subR=Kazunori Taguchi
Staff421L=Marketing Producer
Staff421R=永田 厚二
Staff421_subR=Kouji Nagata
Staff423L=Executive Producer
Staff423R=木戸岡 稔
Staff423_subR=Minoru Kidooka
Staff425L=Production Director
Staff425R=山中 丈嗣
Staff425_subR=Takeshi Yamanaka
Staff427L=General Director
Staff427R=石渡 太輔
Staff427_subR=Daisuke Ishiwatari
Staff438L=logo_arc
